'use strict'

/**
 * @typedef {import('./type.js').Sub_t} Sub_t
 */

const { MessageDef, Subsystem } = require('./type.js');


/**------+---------+---------+---------+---------+---------+---------+----------
 * Spec Source
---------+---------+---------+---------+---------+---------+---------+--------*/

/**
 * @type {ISub_t}
 */
const SUB_92 = [
    '92', new Subsystem({
        name: '92',
        description: '單筆訊息及檔案傳輸系統',
        messages: [
        ],
    })
];

/**
 * @type {ISub_t}
 */
const SUB_95 = [
    '95',  new Subsystem({
        name: '95',
        description: '成交回報子系統',
        messages: [
        ],
    })
]


/**------+---------+---------+---------+---------+---------+---------+----------
 * Spec Object
---------+---------+---------+---------+---------+---------+---------+--------*/

/** @type {Map<string, Subsystem>} */
const SPEC = new Map([SUB_92, SUB_95]);


/**------+---------+---------+---------+---------+---------+---------+----------
 * Exports
---------+---------+---------+---------+---------+---------+---------+--------*/
module.exports = { SPEC };
