'use strict'

const { Subsystem_t, Condition_t } = require('./common.js');


/**------+---------+---------+---------+---------+---------+---------+----------
 * Subsystem Source
---------+---------+---------+---------+---------+---------+---------+--------*/

/**  */
const SUB_92 = [
    '92', new Subsystem_t({
        name: '92',
        description: '單筆訊息及檔案傳輸系統',
        conditions: [
        ],
    })
];

const SUB_95 = [
    '95',  new Subsystem_t({
        name: '95',
        description: '成交回報子系統',
        conditions: [
        ],
    })
]


/**------+---------+---------+---------+---------+---------+---------+----------
 * Subsystem Object
---------+---------+---------+---------+---------+---------+---------+--------*/

/** @type {Map<string, Subsystem>} */
const Subsys = new Map([SUB_92, SUB_95]);


/**------+---------+---------+---------+---------+---------+---------+----------
 * Exports
---------+---------+---------+---------+---------+---------+---------+--------*/
module.exports = { Subsys };
